# <center><ins>SQL Notes</center></ins>

[Documentation Link](https://mariadb.com/kb/en/documentation/)

[SQL **keywords**](https://www.w3schools.com/sql/sql_ref_keywords.asp)

[List of **MySQL functions**](https://www.w3schools.com/sql/sql_ref_mysql.asp)

[MySQL tutorials](https://www.mysqltutorial.org/mysql-basics/)

[W3Resource tutorials](https://www.w3resource.com/sql/tutorials.php)

### <center>REMEMBER to consider if null values exist and if so what is the effect!!!</center>

|<td colspan=3> <center><bold><h3>**Table of contents**<center>|||
|---|:---|:---:|
|**1.**|[**Overview and info**](#Overview-and-info)||
|**2.**|[**Syntax**](#Syntax)|Comments<br>Select statement / nested selects<br>Union<br>Specify number of records to return|
|**3.**|[**CASE expression**](#CASE-expression)|Similar to 'if-then-else'|
|**4.**|[**NULL functions**](#NULL-functions)|IFNULL()<br>ISNULL()<br>COALESCE()|
|**5.**|[**Aliases**](#Aliases)|Temporary name for columns and tables<br>Combine columns AS alias|
|**6.**|[**Joins**](#Joins)|Inner join<br>Left join<br>Right join<br>Outter join<br>Self join|
|**7.**|[**WHERE condition statement**](#WHERE-condition-statement)|AND / OR / XOR / NOT operators<br>IN operator - multiple values<br>BETWEEN operator - given range<br>EXISTS / ANY / ALL boolean operators<br>Test for NULL values|
|**8.**|[**GROUP BY statement**](#GROUP-BY-statement)|Group result-set by one or more columns|
|**9.**|[**HAVING clause**](#HAVING-clause)|Similar to where, but can use aggregate functions|
|**10.**|[**ORDER BY statement**](#ORDER-BY-statement)|Sort result-set|
|**11.**|[**Numeric Aggregate functions**](#Numeric-aggregate-functions)|Takes a list of values and returns just one<br>Min / Max / Count / Average /<br>Sum / Round|
|**12.**|[**String functions**](#String-functions)|Length / Left / Right / Concat /<br>Replace / Substring|
|**13.**|[**SQL Operators**](#SQL-Operators)|Arithmatic / Bitwise / Comparison /<br>Compound / Logical<br>operators
|**14.**|[**LIKE Operator and Wildcards**](#LIKE-Operator-and-Wildcards)|Search for specific patterns|
|**15.**|[**Sequences**](#Sequences)|Create sequence|
|**16.**|[**Store procedures**](#Store-procedures)|Save and reuse SQL statements<br>(SELECT....WHERE...GROUP...ORDER...ect)|
|**17.**|[**Database Operations**](#Database-Operations)|Connect to server<br>List / select databases<br>List tables<br>List table definitions / indexes<br>Dot notation<br>Create / delete database|
|**18.**|[**Backups**](#Backups)|Create database backup|
|**19.**|[**Tables**](#Tables)|Create / delete / clear tables<br>Create indexes<br>Alter table / column names|
|**20.**|[**Manipulating tables**](#Manipulating-tables)|Insert new records<br>Copy data from one table to another<br>Modify records<br>Delete records|
|**21.**|[**Views**](#Views)|Create / query / update / drop<br>views (virtual tables)|
|**22.**|[**Constraints**](#Constraints)|Specify rules for and limit the<br>data that can go into a table<br>NOT NULL / UNIQUE / PRIMARY KEY<br>FOREIGN KEY / CHECK / DEFAULT / AUTO_INCREMENT<br>On update / delete reference_options|
|**23.**|[**DCL**](#DCL)|Grant / Revoke|
|**24.**|[**Data Types**](#Data-Types)|String / Numeric / Date and time<br>data types|

### Overview and info

<ins>Relational database systems</ins> ensure the four <ins>**ACID**</ins> properties:  
* **ATOMIC**  
&ensp; - Each transaction is **“all or nothing”** – a transaction may fail, but if it does so it will fail completely rather than be partially completed.  
* **CONSISTENT**  
&ensp; - **No transaction can fail** in such a way **that constraints are violated.** Constraints include primary and foreign key rules.  
* **ISOLATED**  
&ensp; - Actions in one transaction will **not be visible** to another transaction.  
* **DURABLE**  
&ensp; - Once a **COMMIT** has been successful the **change is permanent.**

### What is SQL?  
**Structured Query Language**  
SQL is a **declarative language**. That is to say that each statement is interpreted in isolation so that it is not possible to construct a flow of control as is possible in Java or C#.  

Used to communicate with a database:  
* Select  
* Create  
* Insert  
* Update  
* Delete

### SQL **components**  
**DML** – Data Manipulation Language  
- Change and access the data itself  
- These statements let you get data out and put data in.  
- You can change existing data  
- Includes:  
    * SELECT  
    * INSERT 
    * UPDATE
    * DELETE  
**DDL** – Data Definition Language  
- Creating and changing data structures  
- Allows you to create and destroy tables  
- Used to set up connections between tables  
- You can create rules to prevent users doing dumb things  
- Includes:  
    * CREATE  
    * ALTER  
    * DROP  
**DCL** – Data Control Language  
- Allows users access  
- You can set permissions so that different users have different levels of access  
- Includes:  
    * GRANT  
    * REVOKE  
**TCL** – Transaction Control Language  
- Controlling transactions  
- You can specify what happens when conflicts occur  
- What should happen if you change the data while I am reading it

### **RDBMS**  

RDBMS stands for **Relational Database Management System.** and is the **basis for SQL**, and for all modern database systems such as MS SQL Server, IBM DB2, Oracle, MySQL, and Microsoft Access.  

The **data** in RDBMS is **stored in database <ins>objects</ins>** called **<ins>tables</ins>.**  
A **table is** a **collection** of **related data entries** and it **consists of columns and rows.**  
A database most often contains one or more tables. Each table is identified by a name.  

Every table is broken up into smaller entities called **fields.**  
A **field is a column in a table** that is designed to maintain specific information about every record in the table.  
A column is a vertical entity in a table that contains all information associated with a specific field in a table.  

A **record**, also called **a row**, is each individual entry that exists in a table.

### **SQL keywords are NOT case sensitive**  
Some database systems **require a semicolon** at the **end of each SQL statement.**

### Some of The Most Important SQL Commands  
**SELECT** - extracts data from a database  
**UPDATE** - updates data in a database  
**DELETE** - deletes data from a database  
**INSERT INTO** - inserts new data into a database  
**CREATE DATABASE** - creates a new database  
**ALTER DATABASE** - modifies a database  
**CREATE TABLE** - creates a new table  
**ALTER TABLE** - modifies a table  
**DROP TABLE** - deletes a table  
**CREATE INDEX** - creates an index (search key)  
**DROP INDEX** - deletes an index

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

---

---

### <center>Syntax</center>

**Comments in SQL**  

* Comments are not supported in Microsoft Access databases.  

**Single line comment**  
**`--`**  

**Multi-line comment**  
**`/*`**  
**`...`**  
**`...`**  
**`*/`**

---

**SELECT statement**  

**`SELECT column1, column2, ...`**  
**`FROM table_name;`**  
* Used to **select data from a database.**  
* **DO NOT** use comma after column1 if only selecting one field  
* The data returned is stored in a result table, called the **result-set.**  
* **EVERY** SQL statement (as a whole), ends with **`;`**  
* Perform an operation on columns as follows:  
&emsp;&emsp;**`SELECT column1, column2/column3`**  &emsp;-- Divides column2 value by column3 value and displays in its own column.  
    * Can also perform this with a value rather than another column.  
    * Follow with **`AS new_column_name`** to rename the column in the result set.  
    * Useful operations here include:  
    * **`ROUND(column_name/1000, decimal_places)`**  -- example would return column_name in 1000's to stated decimal_places. Use negative decimal places to round to nearest 10, 1000 ect.    

**Nested selects**  
**`SELECT columnName, ...`**  
**`FROM (SELECT columnName, ...`**  
&emsp;&emsp;&emsp;**`FROM ...`**  
&emsp;&emsp;&emsp;**`WHERE ...`**  
&emsp;&emsp;&emsp;**`GROUP BY ...`**  
&emsp;&emsp;&emsp;**`...)`**  
**`WHERE ...`**  
**`;`**  

Select **ALL fields** availiable:  
**`SELECT *`**  
**`FROM table_name;`**

---

**SELECT DISTINCT (different) statement**  

**`SELECT DISTINCT column1, column2, ...`**  
**`FROM table_name;`**  
* Returns only **distinct (different) values.**  
* Note values which are duplicated in the table will still be returned, but only once.

---

**UNION operator**  

**`SELECT column_name(s) FROM table1`**  
**`WHERE...(optional)`**  
**`UNION`**  
**`SELECT column_name(s) FROM table2;`**  
**`WHERE...(optional)`**  
**`ORDER...(optional)`**  
* Selects **only distinct** values by **default**.
* Use keyword **`UNION ALL`** to **<u>ALLOW</u> duplicates**.  
* Used to combine the result-set of two or more SELECT statements.  
* Every SELECT statement within UNION must have the **same number of columns**.  
* The columns must also have **similar data types**.  
* The columns in every SELECT statement must also be in the **same order**.

---

**Specify <ins>number</ins> of records to return**  

|**Database System**|**Syntax**|**Note**|
|:---|:---|:---|
|SQL Server / MS Access|`SELECT TOP number\|percent column_name(s)`<br>`FROM table_name`<br>`WHERE condition;`|For %, enter percentage followed by keyword `PERCENT`<br>(rounds up to nearest whole number of records)|
|MySQL|`SELECT column_name(s)`<br>`FROM table_name`<br>`WHERE condition`<br>`LIMIT number;`||
|Oracle 12 Syntax|`SELECT column_name(s)`<br>`FROM table_name`<br>`ORDER BY column_name(s)`<br>`FETCH FIRST number ROWS ONLY;`||
|Older Oracle Syntax|`SELECT column_name(s)`<br>`FROM table_name`<br>`WHERE ROWNUM <= number;`||
|Older Oracle Syntax (with ORDER BY)|`SELECT *`<br>`FROM (SELECT column_name(s) FROM table_name ORDER BY column_name(s))`<br>`WHERE ROWNUM <= number;`||

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

---

#### CASE expression

**`CASE`**  
&emsp;&emsp;**`WHEN condition1 THEN result1`**  
&emsp;&emsp;**`WHEN condition2 THEN result2`**  
&emsp;&emsp;**`WHEN conditionN THEN resultN`**  
&emsp;&emsp;**`ELSE result`**  
**`END;`**  

* Returns a value when the **first condition is met** (like an if-then-else statement).  
* Once a condition is true, it will **stop reading and return the result**.  
* If no conditions are true, it returns the value in the ELSE clause.  
* If there is **no ELSE** part **and no conditions are true, it returns NULL**.  

Using CASE with **SELECT**:  
**`SELECT column(s)`**  
**`CASE`**  
&emsp;&emsp;**`WHEN ...THEN ...`**  
&emsp;&emsp;**`ELSE ...`**  
**`END AS result_column_name (optional)`**  
**`FROM table_name;`**  

Using CASE with **ORDER BY**:  
**`SELECT column(s)`**  
**`FROM table_name`**  
**`ORDER BY`**  
**`(CASE`**  
&emsp;&emsp;**`WHEN ...THEN ...`**  
&emsp;&emsp;**`ELSE ...`**  
**`END);`**

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

---

#### NULL functions

Usually used with SELECT statement.  
Useful to use with mathmatical functions when NULL values would cause an error.  
Or to replace NULL values / get non-null values.  
**`SELECT column(s), NULL_function() AS ...`**  
**`FROM table_name;`**  

**`IFNULL(column_name/value, NULLreplacement_value)`**  
* Returns the **first value if** the value is **NOT NULL**, and **otherwise** returns the **second value**.  
* Always takes **2 arguments**.  

**`ISNULL(expression)`**  
* Takes 1 argument, returns **1 when NULL** and **0 when NOT NULL**.   

**`COALESCE(column_name/value,...)`**  
* Returns the **first NOT-NULL** value.
* If **all values NULL**, returns **NULL**.  
* No limit on values, evaluates in order passed left to right.  
* At least **1 argument must be passed**.

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

---

#### Aliases

* Used to give a **table**, or a **column** in a table, a **temporary name**.  
* Aliases are often used to make column names more readable.  
* An alias **only exists for the duration of that query**.  
* An alias is created with the **`AS`** keyword.  

**Column syntax**  
**`SELECT column_name AS alias_name`**  
**`FROM table_name;`**  
* Use **Square brackets** or **double quotes** if alias contains **spaces**  

**Table syntax**  
**`SELECT column_name(s)`**  
**`FROM table_name AS alias_name;`** 
* Reference the table alias in the WHERE clause with a **"."** i.e. **`WHERE alias_name.columnName/condition...`**  
* Can also be specified **WITHOUT** the **`AS`**

---

**Combine columns AS alias**  

**`SELECT column_name(not combined), 1stColumn_toCombine + ', ' + 2ndColumn_toCombine + ' ' + ... AS alias_name`**  
**`FROM table_name;`**  
* Strings can be added in single quotes  

**In MySQL use**  
**`SELECT column_name(not combined), CONCAT(1stColumn_toCombine, ', ' , 2ndColumn_toCombine , ' ' , ... ) AS alias_name`**  
**`FROM table_name;`**  

**In Oracle use**  
**`SELECT column_name(not combined), (1stColumn_toCombine || ', ' || 2ndColumn_toCombine || ' ' || ... ) AS alias_name`**  
**`FROM table_name;`**

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

---

#### Joins

In [ ]:
select table.col
from 1st_tablee
join 2nd_table on 1st.col=2nd.col
join 3rd_table on 1/2.col=3rd.col

* Used to join 2 or more tables together with matching values to obtain data stored across them.  
* Joins can be chained to create more complex joins.  
* Can chain joins in either of the following ways, both are equivalent:  

1:  
**`SELECT *`**  
**`FROM A JOIN B JOIN C JOIN D;`**  

2:  
**`SELECT *`**  
**`FROM ( ( A JOIN B ) JOIN C ) JOIN D;`**  


![](https://www.sqlshack.com/wp-content/uploads/2019/10/word-image-6.png)  
Above represented by:  
`...`  
`INNER JOIN orders`  
`ON onlinecustomers.customerid = orders.customerid`  
`INNER JOIN sales`  
`ON orders.orderid = sales.orderid;` 

![](https://www.sqlshack.com/wp-content/uploads/2019/10/word-image-7.png)  
Above represented by:  
`...`  
`INNER JOIN orders`  
`ON onlinecustomers.customerid = orders.customerid`  
`LEFT JOIN sales`  
`ON orders.orderid = sales.orderid`  
`WHERE sales.salesid IS NULL`  

**JOIN Syntax**  
**`SELECT table_name.column_names(s)`**  
**`FROM table_name (left table)`**  
**`join_type JOIN table_name (right table)`** &emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp; **-- This line..**  
**`ON left_table_name.column_name condition right_table_name.column_name`** &emsp;&emsp; **-- And this line, can be repeated to join left table to multiple tables/multiple joins**  
**`WHERE.....`**  
**`ORDER...`**  
**`;`**  
* **`WHERE`** and **`ORDER`** are not always used with joins, but when they are they come **AFTER** the join statement.  
* **`ON`** statement is the column values to match from each table and where to join the tables.  
* **`table_name`** in SELECT clause only required when columns are ambiguous and present in more than 1 table. Aliases can be used.    

![](https://www.w3schools.com/sql/img_innerjoin.gif)   ![](https://www.w3schools.com/sql/img_leftjoin.gif)   ![](https://www.w3schools.com/sql/img_rightjoin.gif)   ![](https://www.w3schools.com/sql/img_fulljoin.gif)  

**`join_types:`**  

**(INNER) join**  
* Keyword **`INNER JOIN`** OR **`JOIN`**.  
* Returns records that have **matching** values in **both tables**.  

**LEFT join**  
* Keyword **`LEFT JOIN`** in some databases, keyword is **`RIGHT OUTER JOIN`**.    
* Returns **all** records from the **left table** (nulls in right table results), and the **matched** records from the **right table**.   

**RIGHT join**  
* Keyword **`RIGHT JOIN`** in some databases, keyword is **`RIGHT OUTER JOIN`**.    
* Returns **all** records from the **right table** (nulls in left table results), and the **matched** records from the **left table**.  

**FULL OUTTER join**  
* Keyword **`FULL OUTER JOIN`** OR **`FULL JOIN`** , both keywords are the same.  
* Returns **all** records from **both left and right tables**, when there is a match the rows are joined. **When no match**, there will be **nulls in columns for other table**.    
* Can potentially return **very large result-sets**.  
* **NOT** supported by MySQL and SQLite.

**Self join**  

**`SELECT column_name(s)`**  
**`FROM table1 T1, table1 T2`**  
**`WHERE condition;`**  
* A self join is a regular join, but the table is joined with itself.  
* Used where there is any relationship between rows stored in the same table.

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

---

#### WHERE condition statement

**`SELECT column1, column2, ...`**  
**`FROM table_name`**  
**`WHERE condition;`**  
* SQL requires **single quotes around <ins>text</ins> values** (most database systems will also allow double quotes). However, numeric fields should not be enclosed in quotes.  
* Use parenthesis to form complex expressions.  
* **`condition`** can be a field followed by an operator then a value to be present for returned records  
&ensp; e.g. **`WHERE Country='Germany' AND (City='Berlin' OR City='München');`**  
* The WHERE clause is not only used in SELECT statements, it is **also used in UPDATE, DELETE, etc.**  
* **Cannot** be used with **aggregate functions** (functions which take a list of values and returns just one). If wanting **aggregate functions**, see **HAVING** clause.  
* **Comparison operators can be used** in where clause.

WHERE clause can be combined with **`AND`**, **`OR`** , **`XOR`** and **`NOT`** operators.  

**AND syntax**  
**`SELECT column1, column2, ...`**  
**`FROM table_name`**  
**`WHERE condition1 AND condition2 AND condition3 ...;`**  

**OR syntax**
* **Inclusive** or 

**`SELECT column1, column2, ...`**  
**`FROM table_name`**  
**`WHERE condition1 OR condition2 OR condition3 ...;`**  

**XOR syntax**  
* **Exclusive** or  

**`SELECT column1, column2, ...`**  
**`FROM table_name`**  
**`WHERE condition1 XOR condition2 XOR condition3 ...;`**

**NOT syntax**  
**`SELECT column1, column2, ...`**  
**`FROM table_name`**  
**`WHERE NOT condition;`**  

---

**IN operator**  
**`SELECT column1, column2, ...`**  
**`FROM table_name`**  
**`WHERE column_name IN (value1, value2, ...);`**  
* **Specify multiple values** in a WHERE clause.  
* This is **faster** than **`OR`**  
* Can be **preceeded** by **`NOT`** to negate.  **`WHERE column_name NOT IN (value1, value2, ...);`**

---

**BETWEEN operator**  
**`SELECT column_name(s)`**  
**`FROM table_name`**  
**`WHERE column_name BETWEEN value1 AND value2;`**  
* Selects values within a given range in WHERE clause.   
* Values can be **numbers, text, or dates**.  
* Operator is **inclusive**.

---

**EXISTS operator**  

**`SELECT column_name(s)`**  
**`FROM table_name`**  
**`WHERE EXISTS (SELECT column_name FROM table_name WHERE condition);`**  
* Used to test for the existence of any record in a subquery.  
* Returns **TRUE** if the subquery returns **one or more records**.

**ANY operator**  

**`SELECT column_name(s)`**  
**`FROM table_name`**  
**`WHERE column_name operator ANY`**  
&emsp;&emsp;**`(SELECT column_name`**  
&emsp;&emsp;**`FROM table_name`**  
&emsp;&emsp;**`WHERE condition);`**  
* Returns a **boolean** value as a result  
* Returns TRUE if ANY of the subquery values meet the condition

**ALL operator**  

**`SELECT column_name(s)`**  
**`FROM table_name`**  
**`WHERE column_name operator ALL`**  
&emsp;&emsp;**`(SELECT column_name`**  
&emsp;&emsp;**`FROM table_name`**  
&emsp;&emsp;**`WHERE condition);`**  

When used with SELECT statement:  

**`SELECT ALL column_name(s)`**  
**`FROM table_name`**  
**`WHERE condition;`**  
* Returns a **boolean** value as a result  
* Returns TRUE if ALL of the subquery values meet the condition  
* Used with SELECT, WHERE and HAVING statements

**Test for NULL values**  

**`SELECT column_names`**  
**`FROM table_name`**  
**`WHERE column_name IS NULL|IS NOT NULL;`**  
* It is **not possible** to test for NULL values **with comparison operators.**  
* A NULL value is different from a zero value or a field that contains spaces. A field with a NULL value is one that has been **left blank during record creation.**

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

---

#### GROUP BY statement

**`SELECT column_name(s)`**  
**`FROM table_name`**  
**`WHERE condition`**  
**`GROUP BY column_name(s)`**  
**`ORDER BY column_name(s);`**  
* Group the result-set by one or more columns.
* Often used with aggregate functions (functions which take a list of values and returns just one) (COUNT(), MAX(), MIN(), SUM(), AVG()) (usually in the SELECT statement)

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

---

#### HAVING clause

**`SELECT column_name(s)`**  
**`FROM table_name`**  
**`WHERE condition`**  
**`GROUP BY column_name(s)`**  
**`HAVING condition`**  
**`ORDER BY column_name(s);`**  
* Similar to WHERE, but can be used with **aggregate functions** (functions which take a list of values and returns just one)  
* The HAVING clause was added to SQL because the WHERE keyword cannot be used with aggregate functions, e.g. HAVING COUNT(CustomerID) > 5;

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

---

#### ORDER BY statement

**`SELECT column1, column2, ...`**  
**`FROM table_name`**  
**`WHERE condition`**  
**`ORDER BY column1, column2, ... ASC|DESC;`**  
* Used to **sort the result-set in ascending or descending order.**  
* Sorts the records in **ascending order by default.**  
* Sort by several columns in **different ascending or decending** order as follows:  
&ensp; **`ORDER BY column1 ASC, column2 DESC;`**

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

---

### Numeric aggregate functions

**Minimum value**  

**`SELECT MIN(column_name)`**  
**`FROM table_name`**  
**`WHERE condition;`**  
* Returns the smallest value of the selected column.  
* **Rename returned column** using **`AS`**:  
&ensp; **`SELECT MIN(column_name) AS NewColumn_name`**

**Maximum value**  

**`SELECT MAX(column_name)`**  
**`FROM table_name`**  
**`WHERE condition;`**  
* Returns the largest value of the selected column.  
* **Rename returned column** using **`AS`**:  
&ensp; **`SELECT MAX(column_name) AS NewColumn_name`**

**COUNT**  

**`SELECT COUNT(column_name)`**  
**`FROM table_name`**  
**`WHERE condition;`**  
* Returns the **number of rows** that **matches** a specified criterion.  
* **NULL** values are **not counted.**

**Average**  

**`SELECT AVG(column_name)`**  
**`FROM table_name`**  
**`WHERE condition;`**  
* Returns the **average value** of a **numeric column.**  
* **NULL** values are **ignored.**

**SUM**  

**`SELECT SUM(column_name)`**  
**`FROM table_name`**  
**`WHERE condition;`**  
* Returns the **total sum** of a **numeric column.**  
* **NULL** values are **ignored.**

**ROUND**  

**`SELECT ROUND(number, decimals)`**  
**`...`**  
**`;`**  
* **`decimals`** is optional, when not provided, an integer with no decimals is returned.  
* Use **negative** **`decimals`** to round to nearest 10, 1000 etc. e.g. -3 = nearest 1000  
* **Rounds a number** to a specified number of decimal places.  
* **`number`** can be a column which contains a numeric value.

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

---

#### String functions

**LENGTH**  

**`SELECT LENGTH(string) AS 'Length of String'`**  
**`...`**  
**`;`**  
* **`string`** can be a column name containing a string value.  
* Returns the length of a string (in bytes).

**LEFT**  

**`SELECT LEFT(string, number_of_chars)`**  
**`...`**  
**`;`**  
* Extracts a number of characters from a string (starting from left).

**RIGHT**  

**`SELECT RIGHT(string, number_of_chars)`**  
**`...`**  
**`;`**  
* Extracts a number of characters from a string (starting from right).

**CONCAT**  

**`SELECT CONCAT('string1', 'string2'...) AS ConcatenatedString`**  
**`...`**  
**`;`**  
* Joins strings into single output.  
* **`string`** can be **columns** containing string values to combine columns. **Do not** include **`''`** when referring to columns.  
* **`CONCAT_WS('seperator', 'string1', 'string2'...)`** can be used to combine with **`'seperator'**.

**REPLACE**  

**`REPLACE(string, from_string, new_string)`**  
* Replaces **`from_string`** components with **`new_string`** components of **`string`**  
* **IS** casesensitive.  
* Can be applied to entire columns e.g.   

|column1|column2|column3|
|:---|:---|:---|
|aa|aa|c|
|aa|AA|c|
|aaba|aa|ccc|

`SELECT REPLACE(column_name1, column_name2, column_name3) AS Replaced_values, column2, column3`  
`FROM example;`  

|Replaced_values|column2|column3|
|:---|:---|:---|
|c|aa|c|
|aa|AA|c|
|cccba|aa|ccc|

   * Would replace those values in column_name1 which match column_name2 values with values from column_name3, note that the part of the values in column_name1 that do not match column_name2 would be left as they were. Also, because this is not part of a SELECT INTO or UPDATE statement, this would only affect the result-set.

**SUBSTRING**  

**`SUBSTRING(string, start, number_of_characters)`**  
* Extracts a substring from a string.  
* **`string`** can be a column containing string values.  
* **1st character** is when **`start`** = **1**...**NOT indexing**.  
* Note 3rd argument is **`number_of_characters`** and not an index. This is also **optional**  
* **`start`** can be **negative**, in which case it will count from the **end of the string**.

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

---

#### SQL Operators

**Arithmetic Operators**  

|Operator|Description|
|:---:|:---:|
|+|Add|
|-|Subtract|
|\*|Multiply|
|/|Divide|
|%|Modulo|

**Bitwise Operators**  

|Operator|Description|
|:---:|:---|
|&|Bitwise AND|
|\||Bitwise OR|
|^|Bitwise exclusive OR|

**Comparison Operators**  

|<center>Operator</center>|<center>Description</center>|
|:---:|:---|
|=|Equal|
|>|Greater than|
|<|Less than|
|>=|Greater than or equal|
|<=|Less than or equal|
|<>|Not equal. Note: In some versions of SQL this operator may be written as !=|
|BETWEEN|Between a certain range|
|LIKE|Search for a pattern|
|IN|To specify multiple possible values for a column|

**Compound Operators**  

|Operator|Description|
|:---:|:---|
|+=|Add equals|
|-=|Subtract equals|
|\*=|Multiply equals|
|/=|Divide equals|
|%=|Modulo equals|
|&=|Bitwise AND equals|
|^-=|Bitwise exclusive equals|
|\|\*=|Bitwise OR equals|

**Logical Operators**  

|Operator|Description|
|:---:|:---|
|ALL|TRUE if all of the subquery values meet the condition|
|AND|TRUE if all the conditions separated by AND is TRUE|
|ANY|TRUE if any of the subquery values meet the condition|
|BETWEEN|TRUE if the operand is within the range of comparisons|
|EXISTS|TRUE if the subquery returns one or more records|
|IN|TRUE if the operand is equal to one of a list of expressions|
|LIKE|TRUE if the operand matches a pattern|
|NOT|Displays a record if the condition(s) is NOT TRUE|
|OR|TRUE if any of the conditions separated by OR is TRUE|
|SOME|TRUE if any of the subquery values meet the condition|

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

---

#### LIKE Operator and Wildcards

**`SELECT column1, column2, ...`**  
**`FROM table_name`**  
**`WHERE column LIKE pattern;`**  
* **`LIKE`** used in a **`WHERE`** clause to search for a specified pattern in a column.  
* **Wildcards** used with **`LIKE`**.  
* All the wildcards can also be used in combinations.  

**Wildcard characters in MS Access:**  

|**Symbol**|**Description**|**Example*.*|
|:---:|:---:|:---|
|**`*`**|Zero or more characters|**`bl*`** finds bl, black, blue, and blob|
|**`?`**|A single character|**`h?t`** finds hot, hat, and hit|
|**`[]`**|Any single character within the brackets|**`h[oa]t`** finds hot and hat, but not hit|
|**`!`**|Any character not in the brackets|**`h[!oa]t`** finds hit, but not hot and hat|
|**`-`**|Any single character within the specified range|**`c[a-b]t`** finds cat and cbt|
|**`#`**|Any single numeric character|**`2#5`** finds 205, 215, 225, 235, 245, 255, 265, 275, 285, and 295|

**Wildcard characters in SQL Server:**  

|**Symbol**|**Description**|**Example**|
|:---:|:---:|:---|
|**`%`**|Zero or more characters|**`bl%`** finds bl, black, blue, and blob|
|**`_`**|A single character|**`h_t`** finds hot, hat, and hit|
|**`[]`**|Any single character within the brackets|**`h[oa]t`** finds hot and hat, but not hit|
|**`^`**|Any character not in the brackets|**`h[^oa]t`** finds hit, but not hot and hat|
|**`-`**|Any single character within the specified range|**`c[a-b]t`** finds cat and cbt|

Examples showing different LIKE operators with `%` and `_` wildcards (SQL Server):  

|LIKE Operator|Description|
|:---|:---|
|`WHERE CustomerName LIKE 'a%'`|Finds any values that start with "a"|
|`WHERE CustomerName LIKE '%a'`|Finds any values that end with "a"|
|`WHERE CustomerName LIKE '%or%'`|Finds any values that have "or" in any position|
|`WHERE CustomerName LIKE '_r%'`|Finds any values that have "r" in the second position|
|`WHERE CustomerName LIKE 'a_%'`|Finds any values that start with "a" and are at least 2 characters in length|
|`WHERE CustomerName LIKE 'a__%'`|Finds any values that start with "a" and are at least 3 characters in length|
|`WHERE ContactName LIKE 'a%o'`|Finds any values that start with "a" and ends with "o"|

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

---

#### Sequences

**`CREATE SEQUENCE sequence_name`**  
**`START WITH initial_value`**  
**`INCREMENT BY increment_value`**  
**`MINVALUE minimum value`**  
**`MAXVALUE maximum value`**  
**`CACHE|NOCACHE`**  
**`CYCLE|NOCYCLE`**  
**`;`**  
* When sequence reaches its set limit, If **`CYCLE`** is set, it starts from beginning.  
* 2 attributes availiable, obtain with **`sequence_name.attribute`**:  
    * **`NEXTVAL`** - generates a new value and the sequence is incremented.   
    * **`CURRVAL`** - gives the most recent value generated, but the sequence is NOT incremented.  
* Typically used with **INSERT** statment.  
* Sequences can be dropped using the DROP SEQUENCE statement.  
* Sequences can be altered with ALTER SEQUENCE.

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

---

#### Store procedures

**Stored procedures**  

**`CREATE PROCEDURE procedure_name @parameter_name1 dataType(size), @parameter_name2 dataType(size)`**  
**`AS`**  
**`sql_statement`**  
**`GO;`**  
* Saves SQL statements (SELECT....WHERE...GROUP...ORDER...ect) which can be reused with a call.  
* Parameters are optional. Separate multiple parameters with a comma.  

&emsp;&emsp;&emsp;e.g:  
&emsp;&emsp;&emsp;&emsp;**`CREATE PROCEDURE SelectAllCustomers @City nvarchar(30), @PostalCode nvarchar(10)`**  
&emsp;&emsp;&emsp;&emsp;**`AS`**  
&emsp;&emsp;&emsp;&emsp;**`SELECT * FROM Customers WHERE City = @City AND PostalCode = @PostalCode`**  
&emsp;&emsp;&emsp;&emsp;**`GO;`**

**Execute a Stored Procedure**  

**`EXEC procedure_name @parameter_name1 = value, @parameter_name2 = value;`**  

&emsp;&emsp;&emsp;e.g:  
&emsp;&emsp;&emsp;&emsp;**`EXEC SelectAllCustomers @City = 'London', @PostalCode = 'WA1 1DP';`**

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

---

---

### <center>Database Operations</center>

**Connect to MySQL database server**  

**`mysql -u username -p`**

**List Databases**  

**`SHOW DATABASES;`**

**Select Database to work with**  

**`USE database_name;`**

**List Tables**  

**`SHOW TABLES;`**

**Show table definitions**  
**`SHOW CREATE TABLE table_name;`**  
* Lists table definition as it was created (including constraints).

**Display all indexes associated with table**  

**`SHOW INDEX FROM table_name;`**

**Refer to tables in another database**  

**`SELECT * FROM database_name.table_name;`**

**Create Database**  

**`CREATE DATABASE databasename;`**

**Delete Database**    

**`DROP DATABASE databasename;`**  
* **Be careful** before dropping a database. Deleting a database will result in **loss of complete information** stored in the database.

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

#### <center>Backups</center>

**Backup Database**  

**`BACKUP DATABASE databasename`**  
**`TO DISK = 'filepath';`**  
* Creates a full back up of an existing SQL database.  
* Always back up the database to a different drive than the actual database. Then, if you get a disk crash, you will not lose your backup file along with the database.  

**Differential backup**  

**`BACKUP DATABASE databasename`**  
**`TO DISK = 'filepath'`**  
**`WITH DIFFERENTIAL;`**  
* Only backs up the parts of the database that have changed since the last full database backup.  
* Reduces the back up time.

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

#### <center>Tables</center>

**Create Table**  

**`CREATE TABLE table_name (`**  
&emsp;&emsp;&emsp;**`column1 datatype constraint,`**  
&emsp;&emsp;&emsp;**`column2 datatype constraint,`**  
&emsp;&emsp;&emsp;**`column3 datatype constraint,`**  
&emsp;&emsp;&emsp;**`....`**  
**`);`**  
* **Constraints** are **optional**, and can be added or modified with ALTER TABLE.  
* When adding a constraint, replace **`constraint`** with required constraint from table below.  

**Create table from another table**  

**`CREATE TABLE new_table_name AS`**  
&emsp;&emsp;&emsp;**`SELECT column1, column2,...`**  
&emsp;&emsp;&emsp;**`FROM existing_table_name`**  
&emsp;&emsp;&emsp;**`WHERE ....;`**  
* New table will be filled with the existing values from the old table.  
* Specific columns can be copied into a new table rather than entire table...See SELECT INTO statement.

**CREATE INDEX statement**  

**Duplicates allowed:**  
**`CREATE INDEX index_name`**  
**`ON table_name (column1, column2, ...);`**  

**Unique indexes:**  
**`CREATE UNIQUE INDEX index_name`**  
**`ON table_name (column1, column2, ...);`**  
* Used to create and retrieve data from the database very quickly.  
* Users cannot see the indexes, they are just used to **speed up searches/queries**.  
* **Updating** a table with indexes **takes <u>more</u> time** than updating a table without (because the indexes also need an update). So, only create indexes on columns that will be frequently searched against.  

**DROP INDEX**  

**`ALTER TABLE table_name`**  
**`DROP INDEX index_name;`**

**Delete table**  

**`DROP TABLE table_name;`**  
* **Be careful** before dropping a table. Deleting a table will result in **loss of complete information** stored in the table.

**Clear data in table**  

**`TRUNCATE TABLE table_name;`**  
* Deletes the data inside a table, but not the table itself.

**Alter table**  
* Used to add, delete, or modify columns in an existing table.  
* Also used to add and drop various constraints on an existing table.  

**`ALTER TABLE table_name`**  
**`ADD column_name datatype constraint;`**  
* **Add** a column in a table.  

**`ALTER TABLE table_name`**  
**`DROP COLUMN column_name;`**  
* **Delete** a column in a table.  
* Take **caution** when deleting a column.  

**`ALTER TABLE table_name`**  
**`MODIFY column_name datatype constraint;`**  
* **Change datatype**. 
* Constraints are **optional**, when adding a constraint, replace **`constraint`** with required constraint from table below.  

**`ALTER TABLE table_name`**  
**`RENAME COLUMN old_column_name`**  
**`TO new_column_name;`**  
* **Rename column**.

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

---

#### <center>Manipulating tables</center>

**INSERT INTO statement**  

**`INSERT INTO table_name (column1, column2, column3, ...)`**  
**`VALUES`**  
&emsp;&emsp; **`(value1, value2, value3, ...),`** &emsp;&emsp;&emsp; -- **1st new record**   
&emsp;&emsp; **`(value1, value2, value3, ...),`** &emsp;&emsp;&emsp; -- **2nd new record**   
&emsp;&emsp; **`...`**  
**`;`**  
* Used to **insert new records** in a table.  
* If adding values for **all** the **columns** of the table, you **do not need to specify the column names** in the SQL query. However, make sure the **order of the values** is in the **same order as the columns** in the table.  
* Data types must match.  
* Note **values not provided for existing columns** will be set to **null**  
* **SELECT** statement can be used instead of **`VALUES...`** to copy data from one table and insert into another  
* Can use sequences to insert values, e.g. **`VALUES(sequenceName.nextVal, sequenceName.currval)`**

**SELECT INTO statement**  

**`SELECT column_name(s)`**  
**`INTO newtable IN 'externaldb'`**  
**`FROM oldtable`**  
**`WHERE...(optional)`**  
**`;`**  

* **`SELECT INTO`** statement **copies data from one table into a new table**.  
* **`IN`** clause copies data into a new table in **another database**.  
* The new table will be created with the column-names and types as defined in the old table. Create new column names using the AS clause.  
* Can be combined with joins to copy data from more than one table into a new single table.  
* Can be used to create a new, empty table by adding a WHERE statement that causes the query to return no data, e.g. WHERE 1 = 0;

**UPDATE statement**  

**`UPDATE table_name`**  
**`SET column1 = value1, column2 = value2, ...`**  
**`WHERE condition;`**  &emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;**DO NOT OMIT, or all records will be updated**  
* Used to **modify the existing records** in a table.  
* **`WHERE`** clause **specifies** which **record(s) that <ins>should</ins> be updated. If you omit** the WHERE clause, **all records** in the table **will be updated.**

**DELETE statement**  

**`DELETE FROM table_name`**  
**`WHERE condition;`**  &emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;**DO NOT OMIT, or all records will be updated**  
* Used to **delete existing records** in a table.  
* **`WHERE`** clause **specifies** which **record(s) that <ins>should</ins> be updated. If you omit** the WHERE clause, **all records** in the table **will be updated.**

**DELETE ALL records**  

**`DELETE FROM table_name;`**  
* Deletes **all rows** in a table **without deleting the table.** This means that the table structure, attributes, and indexes will be intact.

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

---

#### <center>Views</center>

* A view is a virtual table based on the result-set of an SQL statement.  
* Think of a view as a stored query which is run whenever the view is accessed.  
* A view contains rows and columns, just like a real table. The fields in a view are fields from one or more real tables in the database.  
* You can add SQL statements and functions to a view and present the data as if the data were coming from one single table.  

**CREATE VIEW**  

**`CREATE VIEW [view_name] AS`**  
**`SELECT column1, column2, ...`**  
**`FROM table_name`**  
**`WHERE condition;`**  
* Note **`view_name`** is in **square brackets**  

**Query view**  

**`SELECT * FROM [view_name];`**  

**Update view**  

**`CREATE OR REPLACE VIEW view_name AS`**  
**`SELECT column1, column2, ...`**  
**`FROM table_name`**  
**`WHERE condition;`**  

**DROP VIEW**  

**`DROP VIEW view_name;`**

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

---

#### <center>Constraints</center>

* Used to specify rules for and limit the data that can go into a table.  
* Action is aborted if any violation of the rules.  
* Constraints can be **column level or table level**.  

**`CREATE TABLE table_name (`**  
&emsp;&emsp;&emsp;**`column1 datatype constraintType constraintType,`** &emsp;&emsp;**-- Implementation `[1]` (Contraint NOT named & Single columun)**  
&emsp;&emsp;&emsp;**`column2 datatype constraintType,`** &emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp; **-- Implementation `[1]` (Contraint NOT named & Single columun)**  
&emsp;&emsp;&emsp;**`constraintType(column_name1, column_name2...)`**  &emsp;&emsp;&emsp; **-- Implementation `[2]` (Contraint NOT named & Multiple columun)**  
&emsp;&emsp;&emsp;**`CONSTRAINT constraintName constraintType(column_name1, column_name2...)`**  &emsp;&emsp;**-- Implementation `[3]` (Contraint <u>named</u> & Multiple columun)**  
&emsp;&emsp;&emsp;**`CONSTRAINT constraintType(column_name1, column_name2...)`**  &emsp;&emsp;**-- Implementation `[4]` (Contraint NOT named & Multiple columun)**  
&emsp;&emsp;&emsp;**`PRIMARY KEY (column_name)`**  
&emsp;&emsp;&emsp;**`FOREIGN KEY (column_name)`**  
&emsp;&emsp;&emsp;&emsp;&emsp;**`REFERENCES parent_tableName(columnName)`**  
&emsp;&emsp;&emsp;&emsp;&emsp;**`ON UPDATE reference_option`**  &emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&ensp; **-- optional, defaults to RESTRICT if not provided**  
&emsp;&emsp;&emsp;&emsp;&emsp;**`ON DELETE reference_option`**  &emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&ensp; **-- optional, defaults to RESTRICT if not provided**  
**`);`**
* Note when **more than one** constraint on a **single column `[1]`**, these are **NOT separated by a comma**.  
* Multi column constraints are defined after keyword **`CONSTRAINT`** followed by constraint name, then column list in parentheses. When no constraint name given for constrain types **UNIQUE, PRIMARY KEY, FOREIGN KEY, CHECK**, one will be automatically generated.  

|Reference Option|Description|
|:---|:---|
|CASCADE|If a row from the parent table is deleted or updated, the values of the matching rows in the child table automatically deleted or updated|
|SET NULL|If a row from the parent table is deleted or updated, the values of the foreign key column (or columns) in the child table are set to NULL|
|RESTRICT<br>(default when none given)|If a row from the parent table has a matching row in the child table, MySQL rejects deleting or updating rows in the parent table.<br>Constraint rules are checked before any other operation|
|NO ACTION|Similar to RESTRICT, however constraint rules are checked after the statement and all other operations (such as triggers) are completed|
|SET DEFAULT|Sets the rows in the child table to their default values if the corresponding rows in the parent table are deleted.<br>To execute this action, the foreign key columns must have default definitions.<br>Note that a nullable column has a default value of (NULL) if no default value specified|

**`ALTER TABLE table_name`**  
**`implementation(see table);`** 

**Display indexes**  
**`SHOW INDEX FROM table_name;`**  
* `Key_name` in return refers to constraint names.  

|**ConstraintType**|**Description**|**Implementation**|
|:---|:---|:---|
|**NOT NULL**|Ensures that a column cannot have a NULL value<br>Allows NULL values by default|CREATE -- `[1]` **only**<br>ALTER -- `MODIFY column_name datatype NOT NULL;`<br>Drop using modify without NOT NULL|
|**UNIQUE**|Ensures that all values in a column are different<br>Can have many UNIQUE constraints per table|CREATE -- `[1]` **single unique column**<br>&emsp;&emsp;&emsp;&emsp;&ensp;`[2]`/`[3]`/`[4]` **multiple unique columns, named/not named**<br>A name (key) will be auto generated if none given<br>ALTER -- `ADD CONSTRAINT constraint_name UNIQUE (column_list);` **add unique**<br>ALTER -- `DROP INDEX constraint_name;` **drop unique**|
|**PRIMARY KEY**|A combination of a NOT NULL and UNIQUE.<br>Uniquely identifies each row in a table<br>Can only have **ONE** PRIMARY KEY column per table<br>Can consist of single or multiple columns (fields)<br>**Should** be included in **every** table<br>Table containing PK = parent table|CREATE -- `PRIMARY KEY (column_name)` **single column**<br>CREATE -- `[3]`/`[4]` **named and/or PK consists of multiple columns**<br>A name (key) will be auto generated if none given<br>ALTER -- `ADD .. same as CREATE options` **add primary key**<br>ALTER -- `DROP PRIMARY KEY;` **drop primary key**|
|**FOREIGN KEY**|Prevents actions that would destroy links between tables<br>A field (or collection of fields) in one table, that refers to the PRIMARY KEY in another table<br>Table containing FK = child table<br>Always at **many** end of entity relationship<br>**Can** have **more than one** foreign key, **one representing each relationship** pointing back to each parent primary key<br>**Can** have a **different name** to that of **parent primary key**|CREATE -- `FOREIGN KEY (column_name)` **single column**<br>&emsp;&emsp;&emsp;&emsp;&ensp; `REFERENCES parent_tableName(columnName)`<br>&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;`ON UPDATE reference_option` **optional**<br>&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;`ON DELETE reference_option` **optional**<br>CREATE -- `[3]`/`[4]` **named and/or FK consists of multiple columns**<br>&emsp;&emsp;&emsp;&emsp;&ensp; `REFERENCES parent_tableName(columnName)`<br>&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;`ON UPDATE reference_option` **optional**<br>&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;`ON DELETE reference_option` **optional**<br>**Can also be added after each column:**<br>&emsp;&emsp;&emsp;&emsp;`column_name datatype REFERENCES parent_tableName(columnName)`<br><br>ALTER -- `ADD .. same as CREATE options` **add foreign key**<br>ALTER -- `DROP FOREIGN KEY foreign_key_name;` **drop foreign key**|
|**CHECK**|Ensures that the values in a column satisfies a specific condition|CREATE -- `[1] (condition)` **not named**<br>CREATE -- CONSTRAINT constraintName CHECK (condition) **named**<br>A name (key) will be auto generated if none given<br>If **condition involves 2 or more columns**, use format `[2]` or `[3]`<br><br>ALTER -- `ADD .. same as CREATE options` **add check**<br>ALTER -- `DROP CONSTRAINT constraint_name;` **drop check**|
|**DEFAULT**|Sets a default value for a column if no value is specified which will be added to all new records, if no other value is specified.<br>When foreign key reference option `SET DEFAULT` is present, default values will be set for rows in child table when corresponding rows in parent table are deleted/updated (dependent on reference option)|CREATE -- `[1]` **only**<br>ALTER -- `ALTER column_name SET DEFAULT default_value;` **add default**<br>ALTER -- `ALTER column_name DROP DEFAULT;` **drop default**<br><br>`default_value` must be a literal constant, e.g., a number or a string. It **cannot be** a **function** or an **expression**. MySQL allows you to set the current date and time `CURRENT_TIMESTAMP` to the TIMESTAMP and DATETIME columns.<br>When you define a column without the NOT NULL constraint, the column will implicitly take NULL as the default value|
|**AUTO_INCREMENT**|Allows a unique number to be generated automatically when a new record is inserted into a table.<br>Often this is the primary key field that we would like to be created automatically every time a new record is inserted|CREATE -- `[1]` **only**<br>ALTER -- `MODIFY column_name datatype AUTO_INCREMENT;`<br>Drop using modify without AUTO_INCREMENT<br><br>**Each table** has **only one** AUTO_INCREMENT column<br>Column **must** have a **NOT NULL** constraint<br>By **default**, the **starting value** for AUTO_INCREMENT is **1**, and it will increment by 1 for each new record<br>Set a different start value with `AUTO_INCREMENT=new_value;`|

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

---

### <center>DCL</center>

Data Control Language  
- Allows users access  
- You can set permissions so that different users have different levels of access

**GRANT statement**  

**`GRANT privilege_name`**  
**`ON object_name`**   
**`TO {user_name |PUBLIC |role_name}`**  
**`[WITH GRANT OPTION];`**  
* See details below REVOKE statement.  

**REVOKE statement**  
**`REVOKE privilege_name`**   
**`ON object_name`**  
**`FROM {user_name |PUBLIC |role_name}`**  


* **`privilege_name`** is the access right or privilege granted to the user. Some of the access rights are ALL, EXECUTE, and SELECT.  
* **`object_name`** is the name of an database object like TABLE, VIEW, STORED PROC and SEQUENCE.  
* **`user_name`** is the name of the user to whom an access right is being granted.  
* **`PUBLIC`** is used to grant access rights to all users.  
* ROLES are a set of privileges grouped together.  
* **`WITH GRANT OPTION`** - allows a user to grant access rights to other users.

---

---

### <center>Data Types</center>

**String data types**  

|**Data type**|**Description**|
|:---|:---|
|CHAR(size)|A FIXED length string (can contain letters, numbers, and special characters). The size parameter specifies the column length in characters - can be from 0 to 255. Default is 1|
|NCHAR(size)|Fixed length with maximum length of 4,000 characters - Not supported in MySQL|
|VARCHAR(size)|A VARIABLE length string (can contain letters, numbers, and special characters). The size parameter specifies the maximum column length in characters - can be from 0 to 65535|
|NVARCHAR(size)|Variable-length storage with a maximum length of 4,000 characters - Not supported in MySQL|
|BINARY(size)|Equal to CHAR(), but stores binary byte strings. The size parameter specifies the column length in bytes. Default is 1|
|VARBINARY(size)|Equal to VARCHAR(), but stores binary byte strings. The size parameter specifies the maximum column length in bytes.|
|TINYBLOB|For BLOBs (Binary Large OBjects). Max length: 255 bytes|
|TINYTEXT|Holds a string with a maximum length of 255 characters|
|TEXT(size)|Holds a string with a maximum length of 65,535 bytes|
|NTEXT|Variable-length storage with a maximum size of 1GB data - Not supported in MySQL|
|BLOB(size)|For BLOBs (Binary Large OBjects). Holds up to 65,535 bytes of data|
|MEDIUMTEXT|Holds a string with a maximum length of 16,777,215 characters|
|MEDIUMBLOB|For BLOBs (Binary Large OBjects). Holds up to 16,777,215 bytes of data|
|LONGTEXT|Holds a string with a maximum length of 4,294,967,295 characters|
|LONGBLOB|For BLOBs (Binary Large OBjects). Holds up to 4,294,967,295 bytes of data|
|ENUM(val1,val2,val3,...)|A string object that can have only one value, chosen from a list of possible values. You can list up to 65535 values in an ENUM list. If a value is inserted that is not in the list, a blank value will be inserted. The values are sorted in the order you enter them|
|SET(val1,val2,val3,...)|A string object that can have 0 or more values, chosen from a list of possible values. You can list up to 64 values in a SET list|
|IMAGE|Variable-length storage with maximum size of 2GB binary data|
|XML|For storing XML data|
|JSON|For storing JSON data|

**Numeric data types**  
* All the numeric data types may have an extra option: UNSIGNED or ZEROFILL. If you add the UNSIGNED option, MySQL disallows negative values for the column. If you add the ZEROFILL option, MySQL automatically also adds the UNSIGNED attribute to the column.  
* d in table represents number of decimal points.  
|**Data type**|**Description**|
|:---|:---|
|BIT(size)|A bit-value type. The number of bits per value is specified in size. The size parameter can hold a value from 1 to 64. The default value for size is 1.|
|TINYINT(size)|A very small integer. Signed range is from -128 to 127. Unsigned range is from 0 to 255. The size parameter specifies the maximum display width (which is 255)|
|BOOL&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;|Zero is considered as false, nonzero values are considered as true.|
|BOOLEAN|Equal to BOOL|
|SMALLINT(size)|A small integer. Signed range is from -32768 to 32767. Unsigned range is from 0 to 65535. The size parameter specifies the maximum display width (which is 255)|
|MEDIUMINT(size)|A medium integer. Signed range is from -8388608 to 8388607. Unsigned range is from 0 to 16777215. The size parameter specifies the maximum display width (which is 255)|
|INT(size)|A medium integer. Signed range is from -2147483648 to 2147483647. Unsigned range is from 0 to 4294967295. The size parameter specifies the maximum display width (which is 255)|
|INTEGER(size)|Equal to INT(size)|
|BIGINT(size)|A large integer. Signed range is from -9223372036854775808 to 9223372036854775807. Unsigned range is from 0 to 18446744073709551615. The size parameter specifies the maximum display width (which is 255)|
|FLOAT(size, d)|A floating point number. The total number of digits is specified in size. The number of digits after the decimal point is specified in the d parameter. This syntax is deprecated in MySQL 8.0.17, and it will be removed in future MySQL versions|
|FLOAT(p)|A floating point number. MySQL uses the p value to determine whether to use FLOAT or DOUBLE for the resulting data type. If p is from 0 to 24, the data type becomes FLOAT(). If p is from 25 to 53, the data type becomes DOUBLE()|
|DOUBLE(size, d)|A normal-size floating point number. The total number of digits is specified in size. The number of digits after the decimal point is specified in the d parameter|
|DOUBLE PRECISION(size, d)||
|DECIMAL(size, d)|An exact fixed-point number. The total number of digits is specified in size. The number of digits after the decimal point is specified in the d parameter. The maximum number for size is 65. The maximum number for d is 30. The default value for size is 10. The default value for d is 0.|
|DEC(size, d)|Equal to DECIMAL(size,d)|
|NUMERIC(p,s)|Fixed precision and scale numbers.<br>Allows numbers from -10^38 +1 to 10^38 –1.<br>The p parameter indicates the maximum total number of digits that can be stored (both to the left and to the right of the decimal point). p must be a value from 1 to 38. Default is 18.<br>The s parameter indicates the maximum number of digits stored to the right of the decimal point. s must be a value from 0 to p. Default value is 0|
|smallmoney|Monetary data from -214,748.3648 to 214,748.3647|
|money|Monetary data from -922,337,203,685,477.5808 to 922,337,203,685,477.5807|
|real|Floating precision number data from -3.40E + 38 to 3.40E + 38|

**Date and Time Data Types**  

|**Data type**|**Description**|
|:---|:---|
|DATE|A date. Format: **YYYY-MM-DD**. The supported **range is from '1000-01-01' to '9999-12-31'**|
|DATETIME(fsp)|A date and time combination. Format: **YYYY-MM-DD hh:mm:ss**. The supported **range is from '1000-01-01 00:00:00' to '9999-12-31 23:59:59'**. Adding DEFAULT and ON UPDATE in the column definition to get automatic initialization and updating to the current date and time|
|TIMESTAMP(fsp)|A timestamp. TIMESTAMP values are stored as the number of seconds since the Unix epoch ('1970-01-01 00:00:00' UTC). Format: **YYYY-MM-DD hh:mm:ss**. The supported **range is from '1970-01-01 00:00:01' UTC to '2038-01-09 03:14:07' UTC**. Automatic initialization and updating to the current date and time can be specified using DEFAULT CURRENT_TIMESTAMP and ON UPDATE CURRENT_TIMESTAMP in the column definition|
|TIME(fsp)|A time. Format: **hh:mm:ss**. The supported **range is from '-838:59:59' to '838:59:59'**|
|YEAR|A year in **four-digit format**. Values allowed in four-digit format: **1901 to 2155, and 0000**. MySQL 8.0 does not support year in two-digit format.|

[<p style="text-align: right;">**⬆ Table of Contents ⬆**</p>](#SQL-Notes)

---